In [4]:
import pandas as pd

In [7]:
#시리즈 만들기(문자열)
menu = pd.Series(['육회비빔밥','타코야끼','불닭볶음면'])
menu

0    육회비빔밥
1     타코야끼
2    불닭볶음면
dtype: object

In [8]:
#시리즈 만들기(정수)
price = pd.Series([10000,9000,3000])
price

0    10000
1     9000
2     3000
dtype: int64

In [9]:
#데이터 프레임 만들기 pd.DataFrame({"컬럼명":데이터})
pd.DataFrame({
    "메뉴":menu,
    "가격":price
})

      메뉴     가격
0  육회비빔밥  10000
1   타코야끼   9000
2  불닭볶음면   3000

In [11]:
#데이터 프레임 만들기 pd.DataFrame({"컬럼명":데이터})
df = pd.DataFrame({
    "메뉴":['육회비빔밥','타코야끼','불닭볶음면'],
    "가격":['10000','9000','3000'],
    "원산지":['국내산','국내산','국내산']
})
df

      메뉴     가격  원산지
0  육회비빔밥  10000  국내산
1   타코야끼   9000  국내산
2  불닭볶음면   3000  국내산

In [15]:
#시리즈 선택(메뉴)
df['메뉴']

0    육회비빔밥
1     타코야끼
2    불닭볶음면
Name: 메뉴, dtype: object

In [16]:
#데이터 프레임 선택(메뉴,가격)
df[['메뉴','가격']]

      메뉴     가격
0  육회비빔밥  10000
1   타코야끼   9000
2  불닭볶음면   3000

In [17]:
#데이터 프레임 선택(메뉴,가격)
cols = ['메뉴','가격']
df[cols]

      메뉴     가격
0  육회비빔밥  10000
1   타코야끼   9000
2  불닭볶음면   3000

In [21]:
#데이터 프레임 type 확인
print("df           : ",type(df))
print("df['가격']   : ",type(df['가격']))
print("df[['가격']] : ",type(df[['가격']]))

df           :  <class 'pandas.core.frame.DataFrame'>
df['가격']   :  <class 'pandas.core.series.Series'>
df[['가격']] :  <class 'pandas.core.frame.DataFrame'>

In [22]:
df = pd.DataFrame({
    "메뉴":['아메리카노','카페라뗴','카페모카','에스프레소','밀크티'],
    "가격":[4000,5000,5000,3000,5500],
    "칼로리":[20,110,250,20,300],
})
df

      메뉴    가격  칼로리
0  아메리카노  4000   20
1   카페라뗴  5000  110
2   카페모카  5000  250
3  에스프레소  3000   20
4    밀크티  5500  300

In [23]:
df.to_csv('temp.csv')

In [24]:
temp_df = pd.read_csv('temp.csv')
temp_df.head()
#갑자기 unnamed가 생긴 것을 볼 수 있음

   Unnamed: 0     메뉴    가격  칼로리
0           0  아메리카노  4000   20
1           1   카페라뗴  5000  110
2           2   카페모카  5000  250
3           3  에스프레소  3000   20
4           4    밀크티  5500  300

In [25]:
df.to_csv('cafe.csv',index=False) #index 저장하지 않겠다
df = pd.read_csv('cafe.csv')
df.head()

      메뉴    가격  칼로리
0  아메리카노  4000   20
1   카페라뗴  5000  110
2   카페모카  5000  250
3  에스프레소  3000   20
4    밀크티  5500  300

In [26]:
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4000   20
1   카페라뗴  5000  110

In [27]:
df.tail(3)

      메뉴    가격  칼로리
2   카페모카  5000  250
3  에스프레소  3000   20
4    밀크티  5500  300

In [28]:
df.sample(3) #랜덤으로 보여짐

      메뉴    가격  칼로리
4    밀크티  5500  300
0  아메리카노  4000   20
2   카페모카  5000  250

In [29]:
#데이터프레임 크기(행, 컬럼)
df.shape

(5, 3)

In [30]:
#컬럼 형태(type)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      5 non-null      object
 1   가격      5 non-null      int64
 2   칼로리     5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [31]:
#상관관계
df.corr(numeric_only=True) #데이터프레임에 object컬럼이 있기 때문에

           가격       칼로리
가격   1.000000  0.847408
칼로리  0.847408  1.000000

In [32]:
df_car = pd.DataFrame({
    "car":['Sedan','SUV','Sedan','SUV','SUV','SUV','Sedan','SUV','Sedan','Sedan'],
    "size":['S','M','S','S','M','M','L','S','S','M']
})
df_car.head(3)

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S

In [33]:
#항목 종류 
df_car.nunique() #숫자

car     2
size    3
dtype: int64

In [34]:
#항목 종류
print(df_car['car'].unique())
print(df_car['size'].unique())

['Sedan' 'SUV']
['S' 'M' 'L']

In [35]:
#항목별 개수
print(df_car['car'].value_counts())
print(df_car['size'].value_counts())

car
Sedan    5
SUV      5
Name: count, dtype: int64
size
S    5
M    4
L    1
Name: count, dtype: int64

In [36]:
df.describe()

           가격        칼로리
count     5.0    5.00000
mean   4500.0  140.00000
std    1000.0  129.80755
min    3000.0   20.00000
25%    4000.0   20.00000
50%    5000.0  110.00000
75%    5000.0  250.00000
max    5500.0  300.00000

In [37]:
df_car.describe(include="O")

          car size
count      10   10
unique      2    3
top     Sedan    S
freq        5    5

In [38]:
df.describe(include="O")

           메뉴
count       5
unique      5
top     아메리카노
freq        1

In [40]:
data = {
    "메뉴":['아메리카노','카페라뗴','카페모카','에스프레소','밀크티'],
    "가격":[4000.0,5000.0,5000.0,3000.0,5500.0],
    "칼로리":['20','110','250','20','300'],
}
df=pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      5 non-null      object
 1   가격      5 non-null      float64
 2   칼로리     5 non-null      object
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [41]:
#자료형 변환 / astype / float->int
df['가격'] = df['가격'].astype('int')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      5 non-null      object
 1   가격      5 non-null      int64
 2   칼로리     5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [42]:
#자료형 변환 / astype / object->float
df['칼로리'] = df['칼로리'].astype('float')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      5 non-null      object
 1   가격      5 non-null      int64
 2   칼로리     5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 252.0+ bytes

In [44]:
df = pd.read_csv('cafe.csv')
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4000   20
1   카페라뗴  5000  110

In [45]:
#새로운 컬럼 추가 (값은 0)
df['new'] = 0
df.head(2)

      메뉴    가격  칼로리  new
0  아메리카노  4000   20    0
1   카페라뗴  5000  110    0

In [46]:
#할인가 컬럼 추가
discount=0.2
df['할인가']=df['가격'] * (1-discount)
df.head(2)

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4000   20    0  3200.0
1   카페라뗴  5000  110    0  4000.0

In [48]:
#행 삭제
df = df.drop(1,axis=0)
df.head(3)

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4000   20    0  3200.0
2   카페모카  5000  250    0  4000.0
3  에스프레소  3000   20    0  2400.0

In [50]:
#컬럼 삭제
#axis=0:행방향, axis=1:열방향(컬럼)
df = df.drop('칼로리',axis=1)
df.head(3)

      메뉴    가격  new     할인가
0  아메리카노  4000    0  3200.0
2   카페모카  5000    0  4000.0
3  에스프레소  3000    0  2400.0

In [51]:
df = pd.read_csv('cafe.csv')
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4000   20
1   카페라뗴  5000  110

In [52]:
#인덱싱 (행 전체)
#아메리카노
df.loc[0]

메뉴     아메리카노
가격      4000
칼로리       20
Name: 0, dtype: object

In [54]:
#카페라뗴 가격
df.loc[1,"가격"]
print(df.loc[1,"가격"])

5000

In [55]:
#슬라이싱 (컬럼 전체)
#가격
df.loc[:,"가격"]

0    4000
1    5000
2    5000
3    3000
4    5500
Name: 가격, dtype: int64

In [56]:
#슬라이싱
df.loc[2,'메뉴':'칼로리']

메뉴     카페모카
가격     5000
칼로리     250
Name: 2, dtype: object

In [57]:
#슬라이싱
#카페모카 메뉴와 칼로리
df.loc[2,['메뉴','칼로리']]

메뉴     카페모카
칼로리     250
Name: 2, dtype: object

In [59]:
#슬라이싱
df.loc[1:3,['메뉴','가격']]

      메뉴    가격
1   카페라뗴  5000
2   카페모카  5000
3  에스프레소  3000

In [60]:
df = pd.read_csv('cafe.csv')
df = df.drop(0,axis=0)#첫번째행 삭제
df.head(2)

     메뉴    가격  칼로리
1  카페라뗴  5000  110
2  카페모카  5000  250

In [61]:
#인덱싱(행 전체)
#카페라뗴
df.iloc[0]

메뉴     카페라뗴
가격     5000
칼로리     110
Name: 1, dtype: object

In [62]:
#슬라이싱(컬럼 전체)
#가격
df.iloc[:,1]

1    5000
2    5000
3    3000
4    5500
Name: 가격, dtype: int64

In [63]:
df

      메뉴    가격  칼로리
1   카페라뗴  5000  110
2   카페모카  5000  250
3  에스프레소  3000   20
4    밀크티  5500  300

In [64]:
#슬라이싱
#에스프레소 메뉴와 가격
df.iloc[2,0:2]

메뉴    에스프레소
가격     3000
Name: 3, dtype: object

In [65]:
#슬라이싱(카페모카와 에스프레소의 전체 데이터)
df.iloc[1:3]

      메뉴    가격  칼로리
2   카페모카  5000  250
3  에스프레소  3000   20

In [66]:
#loc 슬라이싱(카페모카와 에스프레소의 전체 데이터)
df.loc[2:3,'메뉴':'칼로리']

      메뉴    가격  칼로리
2   카페모카  5000  250
3  에스프레소  3000   20

In [71]:
import numpy as np
df['원산지']=np.nan
df.head(4)

      메뉴    가격  칼로리  원산지
4    밀크티  5500  300  NaN
1   카페라뗴  5000  110  NaN
2   카페모카  5000  250  NaN
0  아메리카노  4000   20  NaN

In [73]:
df.loc[0,"원산지"]='콜롬비아'
df.loc[1:2, "원산지"]='과테말라'
df.head(4)

      메뉴    가격  칼로리   원산지
4    밀크티  5500  300   NaN
1   카페라뗴  5000  110  과테말라
2   카페모카  5000  250  과테말라
0  아메리카노  4000   20  콜롬비아

In [75]:
df.loc['시즌']=['크리스마스라떼',600,300,'한국']
df.tail(3)

         메뉴    가격  칼로리   원산지
0     아메리카노  4000   20  콜롬비아
3     에스프레소  3000   20  과테말라
시즌  크리스마스라떼   600  300    한국

In [76]:
df.loc[7]={'메뉴':'딴짓커피','가격':2000,'칼로리':20}
df.tail(3)

         메뉴    가격  칼로리   원산지
3     에스프레소  3000   20  과테말라
시즌  크리스마스라떼   600  300    한국
7      딴짓커피  2000   20   NaN

In [78]:
df = df.drop("시즌",axis=0)
df.to_csv('cafe2.csv',index=False)

KeyError: "['시즌'] not found in axis"

In [97]:
df=pd.read_csv('cafe2.csv')
df.head(2)

     메뉴    가격  칼로리   원산지
0   밀크티  5500  300   NaN
1  카페라뗴  5000  110  과테말라

In [98]:
df.sort_values('메뉴',ascending=False)

      메뉴    가격  칼로리   원산지
2   카페모카  5000  250  과테말라
1   카페라뗴  5000  110  과테말라
4  에스프레소  3000   20  과테말라
3  아메리카노  4000   20  콜롬비아
0    밀크티  5500  300   NaN
5   딴짓커피  2000   20   NaN

In [99]:
#가격과 메뉴 기준 정렬
df=df.sort_values(['가격','메뉴'], ascending=[False, True])
df

      메뉴    가격  칼로리   원산지
0    밀크티  5500  300   NaN
1   카페라뗴  5000  110  과테말라
2   카페모카  5000  250  과테말라
3  아메리카노  4000   20  콜롬비아
4  에스프레소  3000   20  과테말라
5   딴짓커피  2000   20   NaN

In [100]:
#인덱스 새로 만들기 drop=True
df.reset_index(drop=True)

      메뉴    가격  칼로리   원산지
0    밀크티  5500  300   NaN
1   카페라뗴  5000  110  과테말라
2   카페모카  5000  250  과테말라
3  아메리카노  4000   20  콜롬비아
4  에스프레소  3000   20  과테말라
5   딴짓커피  2000   20   NaN

In [112]:
df = pd.read_csv('cafe2.csv')
df.head(2)

     메뉴    가격  칼로리   원산지
0   밀크티  5500  300   NaN
1  카페라뗴  5000  110  과테말라

In [113]:
df['칼로리']<50

0    False
1    False
2    False
3     True
4     True
5     True
Name: 칼로리, dtype: bool

In [114]:
#1개 조건
cond=df['칼로리']<50
df[cond]

      메뉴    가격  칼로리   원산지
3  아메리카노  4000   20  콜롬비아
4  에스프레소  3000   20  과테말라
5   딴짓커피  2000   20   NaN

In [115]:
#1개 조건
df[df['칼로리']<50]

      메뉴    가격  칼로리   원산지
3  아메리카노  4000   20  콜롬비아
4  에스프레소  3000   20  과테말라
5   딴짓커피  2000   20   NaN

In [116]:
#2개 이상일 때(and)
cond1 = df['가격'] >= 5000
cond2 = df['칼로리'] > 100
df[cond1 & cond2]

     메뉴    가격  칼로리   원산지
0   밀크티  5500  300   NaN
1  카페라뗴  5000  110  과테말라
2  카페모카  5000  250  과테말라

In [117]:
#2개 이상일 때(or)
df[cond1 | cond2]

     메뉴    가격  칼로리   원산지
0   밀크티  5500  300   NaN
1  카페라뗴  5000  110  과테말라
2  카페모카  5000  250  과테말라

In [118]:
df['메뉴'].isin(['밀크티'])

0     True
1    False
2    False
3    False
4    False
5    False
Name: 메뉴, dtype: bool

In [119]:
cond = df['메뉴'].isin(['밀크티'])
df[cond]

    메뉴    가격  칼로리  원산지
0  밀크티  5500  300  NaN

In [120]:
box=['아메리카노','카페라뗴','밀크티']
cond=df['메뉴'].isin(box)
df[cond]

      메뉴    가격  칼로리   원산지
0    밀크티  5500  300   NaN
1   카페라뗴  5000  110  과테말라
3  아메리카노  4000   20  콜롬비아

In [123]:
df = pd.read_csv('cafe2.csv')
df.head(2)

     메뉴    가격  칼로리   원산지
0   밀크티  5500  300   NaN
1  카페라뗴  5000  110  과테말라

In [125]:
df

      메뉴    가격  칼로리   원산지
0    밀크티  5500  300   NaN
1   카페라뗴  5000  110  과테말라
2   카페모카  5000  250  과테말라
3  아메리카노  4000   20  콜롬비아
4  에스프레소  3000   20  과테말라
5   딴짓커피  2000   20   NaN

In [126]:
df['원산지']=df['원산지'].fillna('코스타리카')
df

      메뉴    가격  칼로리    원산지
0    밀크티  5500  300  코스타리카
1   카페라뗴  5000  110   과테말라
2   카페모카  5000  250   과테말라
3  아메리카노  4000   20   콜롬비아
4  에스프레소  3000   20   과테말라
5   딴짓커피  2000   20  코스타리카

In [127]:
df.to_csv("cafe3.csv",index=False)

In [128]:
pd.read_csv("cafe3.csv")
df.head(3)

     메뉴    가격  칼로리    원산지
0   밀크티  5500  300  코스타리카
1  카페라뗴  5000  110   과테말라
2  카페모카  5000  250   과테말라

In [130]:
#문자 변경
df=df.replace('카페라뗴','자허블')
df=df.replace('밀크티','그린티')
df

      메뉴    가격  칼로리    원산지
0    그린티  5500  300  코스타리카
1    자허블  5000  110   과테말라
2   카페모카  5000  250   과테말라
3  아메리카노  4000   20   콜롬비아
4  에스프레소  3000   20   과테말라
5   딴짓커피  2000   20  코스타리카

In [132]:
change = {'자허블':'카페라떼','그린티':'밀크티'}
df=df.replace(change) #딕셔너리로 먼저 매핑 사전 만들어놓고 나중에 변경 가능
df

      메뉴    가격  칼로리    원산지
0    밀크티  5500  300  코스타리카
1   카페라떼  5000  110   과테말라
2   카페모카  5000  250   과테말라
3  아메리카노  4000   20   콜롬비아
4  에스프레소  3000   20   과테말라
5   딴짓커피  2000   20  코스타리카

In [133]:
df.loc[4,'원산지']='대한민국'
df.tail(3)

      메뉴    가격  칼로리    원산지
3  아메리카노  4000   20   콜롬비아
4  에스프레소  3000   20   대한민국
5   딴짓커피  2000   20  코스타리카

In [134]:
df.loc[1:2,'이벤트가']=1000
df.head()

      메뉴    가격  칼로리    원산지    이벤트가
0    밀크티  5500  300  코스타리카     NaN
1   카페라떼  5000  110   과테말라  1000.0
2   카페모카  5000  250   과테말라  1000.0
3  아메리카노  4000   20   콜롬비아     NaN
4  에스프레소  3000   20   대한민국     NaN

In [135]:
df.to_csv("cafe4.csv",index=False)